{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# УСЛОВИЕ\n",
    "\n",
    "Первый, третий и пятый символы в канадском почтовом индексе представляют собой буквы, а второй, четвертый и шестой – цифры. Провинцию или территорию, которой принадлежит индекс, можно определить по первому символу индекса. Символы D, F, I, O, Q, U, W и Z в настоящее время не используются в почтовых индексах Канады. Второй символ в почтовом индексе определяет, расположен ли интересующий нас адрес в городе или в сельской местности. Если на этом месте стоит ноль, значит, это сельская местность, иначе город. Напишите программу, которая будет запрашивать почтовый индекс у пользователя и отображать провинцию или территорию, которой он принадлежит, с указанием того, городская это территория или сельская. Например, если пользователь введет индекс T2N1N4 , программа должна определить, что речь идет о городе на территории провинции Альберта. А индекс X0A1B2 соответствует сельской местности в провинции Нунавут или в Северо-Западных территориях. Используйте словарь для хранения информации о соответствии первого символа индекса конкретной провинции или территории. Выведите на экран соответствующее сообщение об ошибке, если индекс начинается с символа, который не используется для этих целей, или второй символ не является цифрой"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# РЕШЕНИЕ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "def decode_index(_index: str) -> str:\n",
    "    \"\"\"Принимает в качестве параметра строку,\n",
    "    содержащую индекс и возвращает тип и расположение,\n",
    "    зашифрованного в индексе места\"\"\"\n",
    "\n",
    "    __PLACES = {\n",
    "        \"A\": \"Ньюфаундленд\",\n",
    "        \"B\": \"Новая Шотландия\",\n",
    "        \"C\": \"Остров Принца Эдуарда\",\n",
    "        \"E\": \"Нью-Брансуик\",\n",
    "        \"G\": \"Квебек\",\n",
    "        \"H\": \"Квебек\",\n",
    "        \"J\": \"Квебек\",\n",
    "        \"K\": \"Онтарио\",\n",
    "        \"L\": \"Онтарио\",\n",
    "        \"M\": \"Онтарио\",\n",
    "        \"N\": \"Онтарио\",\n",
    "        \"P\": \"Онтарио\",\n",
    "        \"R\": \"Манитоба\",\n",
    "        \"S\": \"Саскачеван\",\n",
    "        \"T\": \"Альберта\",\n",
    "        \"V\": \"Британская Колумбия\",\n",
    "        \"X\": \"Нунавут или Северо-Западных территориях\",\n",
    "        \"Y\": \"Юкон\"\n",
    "    }\n",
    "\n",
    "    __province = __PLACES.get(_index[0], \"\")\n",
    "    if __province == \"\": return \"Указан некорректный индекс: провинция не существует\"\n",
    "\n",
    "    __locality_id = bool(int(_index[1])) if _index[1].isnumeric() else \"\"\n",
    "    if __locality_id == \"\": return \"Указан некорректный индекс: населённый пункт представлен не цифрой\"\n",
    "\n",
    "    __locality_type = {False: \"Сельская месность\", True: \"Город\"}.get(__locality_id)\n",
    "    return f\"{__locality_type} в провинции {__province}\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# ТЕСТЫ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Город в провинции Альберта\n",
      "Сельская месность в провинции Нунавут или Северо-Западных территориях\n",
      "Указан некорректный индекс: провинция не существует\n",
      "Указан некорректный индекс: населённый пункт представлен не цифрой\n"
     ]
    }
   ],
   "source": [
    "print(decode_index(\"T2N1N4\"))\n",
    "print(decode_index(\"X0A1B2\"))\n",
    "print(decode_index(\"D9A1B2\"))\n",
    "print(decode_index(\"XzA1B2\"))"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "5ef4841162f79949e1a869d41cdba80de50f450cdd77a530598465f6db708fd2"
  },
  "kernelspec": {
   "display_name": "Python 3.10.2 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.2"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
